import asyncio

import converter

ISV_TABLE = '''
А а - Ⰰ ⰰ
Б б - Ⰱ ⰱ
В в - Ⰲ ⰲ
Г г - Ⰳ ⰳ
Є є - Ⱑ ⱑ
Д д - Ⰴ ⰴ
Е е - Ⰵ ⰵ
Је је - Ⰹⰵ ⰹⰵ
Ж ж - Ⰶ ⰶ
И и - Ⰻ ⰻ
Љ љ - Ⰾⱐ ⰾⱐ
Ји ји - Ⰺ ⰺ
Ј ј - Ⰹ ⰹ
К к - Ⰽ ⰽ
Л л - Ⰾ ⰾ
М м - Ⰿ ⰿ
Н н - Ⱀ ⱀ
О о - Ⱁ ⱁ
П п - Ⱂ ⱂ
Р р - Ⱃ ⱃ
С с - Ⱄ ⱄ
Т т - Ⱅ ⱅ
У у - Ⱆ ⱆ
Ф ф - Ⱇ ⱇ
Х х - Ⱈ ⱈ
Ц ц - Ⱌ ⱌ
Ч ч - Ⱍ ⱍ
Ш ш - Ⱎ ⱎ
Шч шч - Ⱋ ⱋ
Ы ы - Ⱏⰹ ⱏⰹ
Њ њ - Ⱀⱐ ⱀⱐ
Ју ју - Ⱓ ⱓ
Ја ја - Ⱝ ⱝ
'''

CYR_TABLE = '''
А а - Ⰰ ⰰ
Б б - Ⰱ ⰱ
В в - Ⰲ ⰲ
Г г - Ⰳ ⰳ
Ґ ґ - Ⰼ ⰼ
Д д - Ⰴ ⰴ
Е е - Ⰵ ⰵ
Є є - ⰉⰅ ⰹⰵ
Ж ж - Ⰶ ⰶ
З з - Ⰸ ⰸ
И и - Ⰻ ⰻ
І і - Ⰹ ⰹ
Ї ї - Ⱑ ⱑ
Й й - Ⰺ ⰺ
К к - Ⰽ ⰽ
Л л - Ⰾ ⰾ
М м - Ⰿ ⰿ
Н н - Ⱀ ⱀ
О о - Ⱁ ⱁ
П п - Ⱂ ⱂ
Р р - Ⱃ ⱃ
С с - Ⱄ ⱄ
Т т - Ⱅ ⱅ
У у - Ⱆ ⱆ
Ф ф - Ⱇ ⱇ
Х х - Ⱈ ⱈ
Ц ц - Ⱌ ⱌ
Ч ч - Ⱍ ⱍ
Ш ш - Ⱎ ⱎ
Щ щ - Ⱋ ⱋ
Ь ь - Ⱐ ⱐ
Ю ю - Ⱓ ⱓ
Я я - Ⱔ ⱔ
' ’ - ⱏ ⱏ
'''

cyr_to_glag = converter.build_converter(CYR_TABLE)
isv_to_glag = converter.build_converter(ISV_TABLE)


async def main():
    pass


if __name__ == '__main__':
    asyncio.run(main())
