ISV_TABLE = '''
А а - Ⰰ ⰰ
Б б - Ⰱ ⰱ
В в - Ⰲ ⰲ
Г г - Ⰳ ⰳ
Є є - Ⱑ ⱑ
Д д - Ⰴ ⰴ
Е е - Ⰵ ⰵ
Је је - Ⰹⰵ ⰹⰵ
Ж ж - Ⰶ ⰶ
И и - Ⰻ ⰻ
Љ љ - Ⰾⱐ ⰾⱐ
Ји ји - Ⰺ ⰺ
Ј ј - Ⰹ ⰹ
К к - Ⰽ ⰽ
Л л - Ⰾ ⰾ
М м - Ⰿ ⰿ
Н н - Ⱀ ⱀ
О о - Ⱁ ⱁ
П п - Ⱂ ⱂ
Р р - Ⱃ ⱃ
С с - Ⱄ ⱄ
Т т - Ⱅ ⱅ
У у - Ⱆ ⱆ
Ф ф - Ⱇ ⱇ
Х х - Ⱈ ⱈ
Ц ц - Ⱌ ⱌ
Ч ч - Ⱍ ⱍ
Ш ш - Ⱎ ⱎ
Шч шч - Ⱋ ⱋ
Ы ы - Ⱏⰹ ⱏⰹ
Њ њ - Ⱀⱐ ⱀⱐ
Ју ју - Ⱓ ⱓ
Ја ја - Ⱝ ⱝ
'''

UKR_TABLE = '''
А а - Ⰰ ⰰ
Б б - Ⰱ ⰱ
В в - Ⰲ ⰲ
Г г - Ⰳ ⰳ
Ґ ґ - Ⰼ ⰼ
Д д - Ⰴ ⰴ
Е е - Ⰵ ⰵ
Є є - ⰉⰅ ⰹⰵ
Ж ж - Ⰶ ⰶ
З з - Ⰸ ⰸ
И и - Ⰻ ⰻ
І і - Ⰹ ⰹ
Ї ї - Ⱑ ⱑ
Й й - Ⰺ ⰺ
К к - Ⰽ ⰽ
Л л - Ⰾ ⰾ
М м - Ⰿ ⰿ
Н н - Ⱀ ⱀ
О о - Ⱁ ⱁ
П п - Ⱂ ⱂ
Р р - Ⱃ ⱃ
С с - Ⱄ ⱄ
Т т - Ⱅ ⱅ
У у - Ⱆ ⱆ
Ф ф - Ⱇ ⱇ
Х х - Ⱈ ⱈ
Ц ц - Ⱌ ⱌ
Ч ч - Ⱍ ⱍ
Ш ш - Ⱎ ⱎ
Щ щ - Ⱋ ⱋ
Ь ь - Ⱐ ⱐ
Ю ю - Ⱓ ⱓ
Я я - Ⱔ ⱔ
' ’ - ⱏ ⱏ
'''

NUMERALS_TABLE = '''
1 - ⰰ
2 - ⰱ
3 - ⰲ
4 - ⰳ
5 - ⰴ
6 - ⰵ
7 - ⰶ
8 - ⰷ
9 - ⰸ

10 - ⰺ
20 - ⰻ
30 - ⰼ
40 - ⰽ
50 - ⰾ
60 - ⰿ
70 - ⱀ
80 - ⱁ
90 - ⱂ

100 - ⱃ
200 - ⱄ
300 - ⱅ
400 - ⱆ
500 - ⱇ
600 - ⱈ
700 - ⱉ
800 - ⱚ
900 - ⱌ

1000 - ⱍ
2000 - ⱎ
3000 - ⱋ
4000 - ⱐ
5000 - ⱑ
6000 - ⱒ
7000 - ⱖ
8000 - ⱓ
9000 - ⱔ
'''
